// 时间段值
export const timeArrs = [
  '08:00',
  '08:30',
  '09:00',
  '09:30',
  '10:00',
  '10:30',
  '11:00',
  '11:30',
  '12:00',
  '12:30',
  '13:00',
  '13:30',
  '14:00',
  '14:30',
  '15:00',
  '15:30',
  '16:00',
  '16:30',
  '17:00',
  '17:30',
  '18:00',
]

export const room_book_info = [
  {
    id: '机台编号 test1',
    name: '机台1',
    dates: [
      {
        date: '2023-05-01',
        books: [
          { name: '张三', id: '张三', start: '08:00', end: '09:30' },
          { name: '赵六', id: '赵六', start: '13:00', end: '14:30' },
          { name: '王老七', id: '王老七', start: '15:00', end: '17:00' },
        ],
      },
      {
        date: '2023-05-02',
        books: [
          { name: '李四', id: '李四', start: '09:00', end: '10:30' },
          { name: '张三', id: '张三', start: '14:00', end: '16:00' },
        ],
      },
      {
        date: '2023-05-03',
        books: [{ name: '王五', id: '王五', start: '11:00', end: '12:30' }],
      },
    ],
  },
  {
    id: '机台编号 test2',
    name: '机台',
    dates: [
      {
        date: '2023-05-01',
        books: [
          { name: '张三', id: '张三', start: '08:00', end: '09:30' },
          { name: '赵六', id: '赵六', start: '13:00', end: '14:30' },
          { name: '王老七', id: '王老七', start: '15:00', end: '17:00' },
          { name: '王老七', id: '王老七', start: '17:30', end: '18:00' },
        ],
      },
      {
        date: '2023-05-02',
        books: [
          { name: '李四', id: '李四', start: '09:00', end: '10:30' },
          { name: '张三', id: '张三', start: '14:00', end: '16:00' },
          { name: '张三', id: '张三', start: '16:30', end: '15:00' },
        ],
      },
      {
        date: '2023-05-03',
        books: [{ name: '王五', id: '王五', start: '11:00', end: '18:00' }],
      },
    ],
  },
]
